xrun(64): 18.09-s011: (c) Copyright 1995-2019 Cadence Design Systems, Inc.
TOOL:	xrun(64)	18.09-s011: Started on Nov 11, 2021 at 20:00:55 CST
xrun
	-64bit
	-gui
	-access r
	test/alu_tb.v
	test/alu_1b_tb.v
	src/alu_1b.v
	src/add_1b.v
	src/add.v
	src/alu.v
	src/mux_8t1_32.v
	src/mux_8t1.v
	src/sll.v
	src/slt.v
	src/sub.v
	src/sub_1b.v
	src/srl.v
	lib/and_gate_32.v
	lib/and_gate.v
	lib/mux_32.v
	lib/mux.v
	lib/nor_gate.v
	lib/not_gate_32.v
	lib/not_gate.v
	lib/or_gate_32.v
	lib/or_gate.v
	lib/xor_gate_32.v
	lib/xor_gate.v
	lib/nand_gate.v
file: test/alu_tb.v
	module worklib.alu_tb:v
		errors: 0, warnings: 0
file: test/alu_1b_tb.v
	module worklib.alu_1b_tb:v
		errors: 0, warnings: 0
file: src/alu_1b.v
	module worklib.alu_1b:v
		errors: 0, warnings: 0
file: src/add_1b.v
	module worklib.add_1b:v
		errors: 0, warnings: 0
file: src/add.v
	module worklib.add:v
		errors: 0, warnings: 0
file: src/alu.v
	module worklib.alu:v
		errors: 0, warnings: 0
file: src/mux_8t1_32.v
	module worklib.mux_8t1_32:v
		errors: 0, warnings: 0
file: src/mux_8t1.v
	module worklib.mux_8t1:v
		errors: 0, warnings: 0
file: src/sll.v
	module worklib.sll:v
		errors: 0, warnings: 0
file: src/slt.v
	module worklib.slt:v
		errors: 0, warnings: 0
file: src/sub.v
	module worklib.sub:v
		errors: 0, warnings: 0
file: src/sub_1b.v
	module worklib.sub_1b:v
		errors: 0, warnings: 0
file: src/srl.v
	module worklib.srl:v
		errors: 0, warnings: 0
file: lib/and_gate_32.v
	module worklib.and_gate_32:v
		errors: 0, warnings: 0
file: lib/and_gate.v
	module worklib.and_gate:v
		errors: 0, warnings: 0
file: lib/mux_32.v
	module worklib.mux_32:v
		errors: 0, warnings: 0
file: lib/mux.v
	module worklib.mux:v
		errors: 0, warnings: 0
file: lib/nor_gate.v
	module worklib.nor_gate:v
		errors: 0, warnings: 0
file: lib/not_gate_32.v
	module worklib.not_gate_32:v
		errors: 0, warnings: 0
file: lib/not_gate.v
	module worklib.not_gate:v
		errors: 0, warnings: 0
file: lib/or_gate_32.v
	module worklib.or_gate_32:v
		errors: 0, warnings: 0
file: lib/or_gate.v
	module worklib.or_gate:v
		errors: 0, warnings: 0
file: lib/xor_gate_32.v
	module worklib.xor_gate_32:v
		errors: 0, warnings: 0
file: lib/xor_gate.v
	module worklib.xor_gate:v
		errors: 0, warnings: 0
file: lib/nand_gate.v
	module worklib.nand_gate:v
		errors: 0, warnings: 0
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		alu_tb
		alu_1b_tb
		sub
	Building instance overlay tables: .................... Done
	Generating native compiled code:
		worklib.nand_gate:v <0x27591acb>
			streams:   0, words:     0
		worklib.alu_1b:v <0x3f6ab15c>
			streams:   1, words:   258
		worklib.alu_1b_tb:v <0x582eafc2>
			streams:   1, words: 10281
		worklib.mux_8t1:v <0x1c1924f8>
			streams:   0, words:     0
		worklib.nor_gate:v <0x25484a6f>
			streams:   0, words:     0
		worklib.mux_32:v <0x3520e797>
			streams:   2, words:   647
		worklib.not_gate:v <0x75f987d8>
			streams:   0, words:     0
		worklib.slt:v <0x47f8aa76>
			streams:   2, words:   358
		worklib.mux:v <0x10b3405c>
			streams:   2, words:   440
		worklib.not_gate_32:v <0x193783ad>
			streams:   1, words:   258
		worklib.or_gate:v <0x6559598f>
			streams:   0, words:     0
		worklib.and_gate:v <0x748ab842>
			streams:   0, words:     0
		worklib.xor_gate:v <0x0610b609>
			streams:   0, words:     0
		worklib.xor_gate_32:v <0x1be210c7>
			streams:   1, words:   334
		worklib.or_gate_32:v <0x4cfddb1e>
			streams:   2, words:   737
		worklib.and_gate_32:v <0x0d359fdf>
			streams:   2, words:   719
		worklib.alu_tb:v <0x796f38ac>
			streams:   3, words: 21474
		worklib.sll:v <0x746db0c4>
			streams:   0, words:     0
		worklib.srl:v <0x616be165>
			streams:   0, words:     0
		worklib.add:v <0x47bb0950>
			streams:   0, words:     0
		worklib.mux_8t1_32:v <0x4cda83e1>
			streams:   1, words:   257
		worklib.alu:v <0x31fc4957>
			streams:   2, words:   493
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                  Instances  Unique
		Modules:               1709      25
		Registers:              565       8
		Scalar wires:          1647       -
		Expanded wires:         390      15
		Vectored wires:           3       -
		Always blocks:          559       2
		Initial blocks:           2       2
		Cont. assignments:       14      34
		Pseudo assignments:       2       2
		Simulation timescale:  10ps
	Writing initial simulation snapshot: worklib.alu_tb:v

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /vol/cadence2018/XCELIUM1809/tools/xcelium/files/xmsimrc
xcelium> run
xmsim: *W,RNQUIE: Simulation is complete.
xcelium> run
xmsim: *W,RNQUIE: Simulation is complete.
xcelium> reset
Loaded snapshot worklib.alu_tb:v
xcelium> database -open waves -into waves.shm -default
Created default SHM database waves
xcelium> probe -create -shm alu_tb.A alu_tb.B alu_tb.CARRY_OUT alu_tb.OVERFLOW alu_tb.RESULT alu_tb.SELECT alu_tb.ZERO_FLAG
Created probe 1
xcelium> run
xmsim: *W,RNQUIE: Simulation is complete.
xcelium> TOOL:	xrun(64)	18.09-s011: Exiting on Nov 11, 2021 at 21:37:18 CST  (total: 01:36:23)
